Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་འདི་སྙམ་དུ་གྱུར་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱམས་པ་འདི་ནི་ཤེས་རབ་ཟབ་མོ་དང་ལྡན་པ་སྟེ།
en: Then the venerable Śāradvatīputra thought, “This bodhisattva great being Maitreya is endowed with profound wisdom.

source: འདི་ལྟར་འདི་ཡང་ཡུན་རིང་པོར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པས་བསྟན་པ་སྟེ།
en: He has indeed revealed this, having over a long period of time practiced the perfection of generosity, and practiced the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: འདི་ནི་མི་དམིགས་པར་སྤྱོད་པས་བསྟན་པའོ།
en: He has revealed this, having practiced without apprehending anything.” {Ki.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཤ་ར་དྭ་ཏིའི་བུ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཤར་དྭ་ཏིའི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཆོས་གང་གིས་ཁྱོད་དགྲ་བཅོམ་པར་བརྗོད་པའི་ཆོས་དེ་ཁྱོད་ཀྱིས་ཡང་དག་པར་རྗེས་སུ་མཐོང་ངམ།
en: IV: 181} Then the Blessed One asked the venerable Śāradvatīputra, “Śāradvatīputra, do you think you can observe anything by which you are declared to be an arhat?” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་དེ་དེ་བཞིན་ཏེ།
en: Śāradvatīputra, so it is!” said the Blessed One. “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ནི་འདི་སྙམ་དུ་ལུང་བསྟན་པའི་ཆོས་དེ་ནི་འདིའོ།
en: Bodhisattva great beings who practice the perfection of wisdom do not think, ‘This is the thing that is prophesied.

source: །ལུང་བསྟན་པར་འགྱུར་བའི་ཆོས་དེ་ནི་འདིའོ།
en: This is the thing that will be prophesied.

source: །ལུང་བསྟན་པར་གྱུར་པའི་ཆོས་དེ་ནི་འདིའོ།
en: This is the thing that has been prophesied.

source: །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བའི་ཆོས་དེ་ནི་འདིའོ་ཞེས་བྱ་བར་མི་སེམས་ཏེ།
en: This is the thing that will attain consummate buddhahood in unsurpassed, complete enlightenment.’

source: དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་སྟེ།
en: Bodhisattva great beings who practice in that manner practice the perfection of wisdom.

source: དེ་ལ་ཐེ་ཙོམ་སྐྱེ་བ་མེད་ཅིང་བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བ་མ་ཡིན་གྱི།
en: Hesitation will not arise in them. They will not think that they themselves will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: བདག་ནི་གདོན་མི་ཟ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་སྙམ་སྟེ།
en: Rather, they will think that they themselves will undoubtedly attain consummate buddhahood in unsurpassed, complete enlightenment.

source: ཤ་ར་དྭ་ཏིའི་བུ་གང་དེ་ལྟར་སྤྱོད་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའོ།
en: Śāradvatīputra, those who practice in that manner practice the perfection of wisdom.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་མི་འཇིགས་མི་དངང་སྐྲག་པར་མི་འགྱུར་ཞིང་བདག་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་མི་རྒྱ་བ་མ་ཡིན་གྱི།
en: Śāradvatīputra, bodhisattva great beings who practice in that manner will not fear, they will not be afraid, and they will not be terrified. They will not think that they themselves will not attain consummate buddhahood in unsurpassed, complete enlightenment.

source: བདག་ནི་གདོན་མི་ཟ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་རོ་སྙམ་མོ།
en: Rather, they will think that they themselves will undoubtedly attain consummate buddhahood in unsurpassed, complete enlightenment.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བགྱིད་ཅིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་གྱུར་པ་ལགས། དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་བཀྲེས་པ་རྣམས་མཐོང་ཞིང་། སེམས་ཅན་སྐོམ་པ་དང་། གོས་ངན་པ་དང་།
en: The venerable Subhūti then asked the Blessed One, “Blessed Lord, how do bodhisattva great beings complete the six perfections and also approach all-aspect omniscience?”

source: ཟས་དང་། གོས་དང་། མལ་ཆས་ཕོངས་པ་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་རྣམས་ཀྱི་ཉེས་པ་འདི་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་མི་འབྱུང་ཞིང་མི་སྲིད་པ་དང་།
en: The Blessed One replied to the venerable Subhūti as follows: “In this regard, Subhūti, when bodhisattva great beings practice the perfection of generosity, if they see beings who are hungry, or if they see beings who are thirsty, with poor clothing, or lacking food, clothing, and bedding, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, all these faults of beings will in each and every way not occur and they will be impossible.

source: རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་མཚེ་མ་དང་དགའ་ལྡན་དང་འཕྲུལ་དགའ་དང་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་སྐྱིད་པ་ཇི་ལྟ་བ་དེ་བཞིན་དུ་སངས་རྒྱས་ཀྱི་ཞིང་དེའི་ལོངས་སྤྱོད་དང་། སྐྱིད་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ་ཞེས་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ།
en: I will practice the perfection of generosity in that manner until the resources and felicity of that buddhafield resemble the resources and felicity of the gods of the Caturmahā­rāja­kāyika realm, and the gods of the Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, and Para­nirmita­vaśa­vartin realms.’

source: རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the perfection of generosity.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དང་ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ།
en: They will also approach unsurpassed, complete enlightenment. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་སྲོག་གཅོད་པ་དག་མཐོང་ངམ། སེམས་ཅན་མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། རྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་ཟེར་བ་དང་། ཞེ་གཅོད་པའི་ཚིག་ཅན་དང་ཚིག་ཀྱལ་པ་སྨྲ་བ་དང་། ཆགས་སེམས་ཅན་དང་། གནོད་སེམས་ཅན་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of ethical discipline, if they see persons who kill living creatures; those who steal, commit sexual misconduct, tell lies, speak slanderously, and speak words that are harsh and words that are nonsensical; those who have thoughts of desire, thoughts of malice, {Ki.

source: ལོག་པར་ལྟ་བ་ཅན་དག་མཐོང་ངམ། སེམས་ཅན་ཚེ་ཐུང་ངུ་དང་། ནད་མང་བ་དང་། མདོག་ངན་པ་དང་། མཐུ་ཆུང་ངུ་དང་། ལོངས་སྤྱོད་ཆུང་ངུ་དང་། རིགས་དམའ་བ་དང་།
en: IV: 182} and hold wrong views—or if they see those who are short-lived, having many illnesses, of poor complexion, with little strength, with few resources, and of low status, or beings with disabled limbs—they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, all these faults of beings will in each and every way not occur and they will be impossible.

source: སེམས་ཅན་ཡན་ལག་དང་ཉིང་ལག་མ་ཚང་བ་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་རྣམས་ཀྱི་ཉེས་པ་འདི་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་མི་འབྱུང་ཞིང་མི་སྲིད་པ་དང་སེམས་ཅན་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་རབ་ཏུ་གནས་པར་འགྱུར་བ། དེ་ལྟ་དེ་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ་ཞེས་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ།
en: I will practice the perfection of ethical discipline in that manner until all beings are established in the way of the ten virtuous actions.’

source: རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the perfection of ethical discipline.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ཕན་ཚུན་དུ་གནོད་པར་སེམས་པ་རྡོ་དང་དབྱིག་པ་དང་མཚོན་གྱིས་འདེབས་ཤིང་རྡེག་པ་དང་། གསོད་པ་དག་མཐོང་ན་འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་རྣམས་ཀྱི་ཉེས་པ་འདི་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་མི་འབྱུང་ཞིང་། མི་སྲིད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལམ་ལྟ་བུའི་སེམས་སུ་འགྱུར་བ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of tolerance, if they see beings acting maliciously toward one another, striking and hitting out with clods of earth, with clubs and swords, depriving others of their lives, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, all these faults of beings will in each and every way not occur and they will be impossible.

source: ཕ་ལྟ་བུའི་སེམས་སུ་འགྱུར་བ་དང་། ཕུ་ནུ་ལྟ་བུའི་སེམས་སུ་འགྱུར་བ་དང་། སྲིང་མོ་ལྟ་བུའི་སེམས་སུ་འགྱུར་བ་དང་། བྱམས་པའི་སེམས་སུ་འགྱུར་བ་དང་། ཕན་པའི་སེམས་སུ་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: I will practice the perfection of tolerance until all beings think of all other beings as their mother, think of them as their father, think of them as their brother, think of them as their sister, think of them with loving kindness, and think of them with altruism.’

source: །ཞེས་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the perfection of tolerance.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དང་ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་བརྩོན་འགྲུས་ཞན་པ་དང་། ལེ་ལོའི་སེམས་དང་ལྡན་པ་དང་། ཐེག་པ་གསུམ་པོ་འདི་ལྟ་སྟེ།
en: They will also approach unsurpassed, complete enlightenment. “

source: ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པ་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་རྣམས་ཀྱི་ཉེས་པ་འདི་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་མི་འབྱུང་ཞིང་མི་སྲིད་པ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of perseverance, if they see beings who are languid and indolent, and who have turned against the three vehicles, namely, the vehicle of the śrāvakas, the vehicle of the pratyekabuddhas, and the vehicle of the buddhas, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, all these faults of beings will in each and every way not occur and they will be impossible.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱང་བརྩོན་འགྲུས་བརྟན་པ་བརྩམས་ཤིང་ཐེག་པ་གསུམ་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བར་འགྱུར་བར་བྱའོ། །ཞེས་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ།
en: All beings will indeed undertake resolute perseverance and attain final nirvāṇa through the three vehicles.’

source: རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the perfection of perseverance.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་འདོད་པའི་སྲེད་པ་དང་། གནོད་སེམས་དང་། རྨུགས་པ་དང་། གཉིད་དང་། རྒོད་པ་དང་འགྱོད་པ་དང་། ཐེ་ཚོམ་དང་སྒྲིབས་པ་ལྔས་བསྒྲིབས་པ་མཐོང་ངམ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of meditative concentration, if they see beings who are clouded by the five obscurations, namely, craving for sensual pleasures, malice, dullness and sleep, agitation and regret, and doubt, {Ki.

source: བསམ་གཏན་དང་པོ་དང་མི་ལྡན་པ་མཐོང་ངམ། བསམ་གཏན་གཉིས་པ་དང་བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་དང་མི་ལྡན་པ་མཐོང་ངམ། བྱམས་པ་དང་མི་ལྡན་པ་མཐོང་ངམ། སྙིང་རྗེ་དང་དགའ་བ་དང་བཏང་སྙོམས་དང་མི་ལྡན་པ་མཐོང་ངམ། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་མི་ལྡན་པ་མཐོང་ངམ། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་།
en: IV: 183} or see them lacking the first meditative concentration; see them lacking the second, third, and fourth meditative concentrations; see them lacking loving kindness; see them lacking compassion, empathetic joy, and equanimity; see them lacking absorption in the sphere of infinite space; and see them lacking absorption in the sphere of infinite consciousness, absorption in the sphere of nothing-at-all, and absorption in the sphere of neither perception nor nonperception, then they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, all these faults of beings will in each and every way not occur and they will be impossible.

source: ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་སྙོམས་པར་འཇུག་པ་དང་མི་ལྡན་པ་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་རྣམས་ཀྱི་ཉེས་པ་འདི་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་མི་འབྱུང་ཞིང་མི་སྲིད་པ་དང་སེམས་ཅན་ཐམས་ཅད་བསམ་གཏན་དང་། ཚད་མེད་པ་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ཐོབ་པར་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: I will practice the perfection of meditative concentration until all beings attain the four meditative concentrations, the four immeasurable attitudes, and the four formless absorptions.

source: །སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱའོ།
en: I will refine the buddhafields!

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱའོ་ཞེས་དེ་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ།
en: I will bring beings to maturity!’

source: རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཡོངས་སུ་རྫོགས་པར་བྱེད། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དང་ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཤེས་རབ་འཆལ་པ་ཅན་གྱི་སེམས་ཅན། འཇིག་རྟེན་པ་དང་།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the perfection of meditative concentration.

source: འཇིག་རྟེན་ལས་འདས་པའི་ཡང་དག་པར་ལྟ་བ་དང་བྲལ་བ། བྱ་བ་མ་ཡིན་པར་སྨྲ་བ། མེད་པར་སྨྲ་བ། ཆད་པར་སྨྲ་བ། རྟག་པར་ལྟ་བ། སེམས་ཅན་དུ་སྨྲ་བ་དག་མཐོང་ན།
en: They will also approach unsurpassed, complete enlightenment. “

source: འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་རྣམས་ཀྱི་ཉེས་པ་འདི་དག་ཐམས་ཅད་དུ། ཐམས་ཅད་མི་འབྱུང་ཞིང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they see beings immersed in stupidity, who lack genuine views, whether mundane or supramundane, who propound inaction, who propound nonexistence, who propound nihilism, or who propound eternalism to beings, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, all these faults of beings will in each and every way not occur and they will be impossible.

source: མི་སྲིད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལྟ་བའི་རྣམ་པ་ཐམས་ཅད་སྤངས་ཤིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་གནས་པར་འགྱུར་བ། དེ་ལྟ་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: I will practice the perfection of wisdom until all beings have abandoned all such aspects of false view and dwell in the perfection of wisdom.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱའོ། །ཞེས་དེ་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ།
en: I will bring beings to maturity!’

source: རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཡོངས་སུ་རྫོགས་པར་བྱེད། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དང་། ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the perfection of wisdom.

source: ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ཕུང་པོ་གསུམ་ལ་གནས་པ། ངེས་པ་དང་། མ་ངེས་པ་དང་། ལོག་པར་ངེས་པ་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ།
en: They will also approach unsurpassed, complete enlightenment. “

source: ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཆུང་ངུ་ན། སེམས་ཅན་ལོག་པར་ངེས་པའི་སྒྲ་ཡང་མི་གྲག་ཅིང་། མི་སྲིད་པ་དེ་ལྟ་དེ་ལྟར། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings belonging to the three categories—of certain receptivity, of unpredictable receptivity, and of certain nonreceptivity—they should then reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until, at the least, not even the words beings of certain nonreceptivity will be heard any longer and it will not be possible for beings to belong to that category.

source: རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the six perfections.

source: རྣམ་པ་ཐམས་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ།
en: They will also approach all-aspect omniscience. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་དམྱལ་བའི་སེམས་ཅན་དག་མཐོང་ངམ། བྱོལ་སོང་གི་སྐྱེ་གནས་པ་དང་། གཤིན་རྗེའི་འཇིག་རྟེན་པའི་སེམས་ཅན་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། ཆུང་ངུ་ན་ངན་སོང་གསུམ་གྱི་སྒྲ་ཡང་མི་གྲག་ཅིང་མི་སྲིད་པ། དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings who have been born in the hells, or if they see beings in the animal realm, or beings in the world of Yama, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until, at the least, not even the words the three inferior realms will be heard any longer, and it will not be possible for beings to be born in them.

source: །སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱའོ།
en: I will bring beings to maturity! {Ki.

source: །ཞེས་དེ་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད།
en: IV: 184} Subhūti, bodhisattva great beings who practice accordingly will indeed complete the six perfections.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། ས་ཆེན་པོ་འདི་ལ་སྡོང་དུ་མ་དང་། ཚེར་མ་དང་། སབ་སུབ་དང་། གཅོང་རོང་དང་། གཡང་ས་དང་།
en: They will also approach all-aspect omniscience. “

source: ལྗན་ལྗིན་དང་། ལུང་ཁུང་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི། སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་སེམས་ཅན་གྱི་ཉེས་པ་དེ་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་མི་འབྱུང་ཞིང་མི་སྲིད་པ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see that this earth is scarred with tree stumps, thorn bushes, jungle ravines, precipices, sewage, and cesspits, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, all these faults of beings will in each and every way not occur and they will be impossible.

source: བདག་གིས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ལག་མཐིལ་ལྟར་མཉམ་པར་འགྱུར་བ། དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: I will practice the six perfections until this buddhafield is level like the palm of a hand.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ།
en: They will also approach all-aspect omniscience. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། ས་ཆེན་པོ་འདི་སའི་རྒྱུ་ལས་གྲུབ་པ་དང་། གསེར་དངུལ་དང་མི་ལྡན་པར་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། ས་ཆེན་པོ་འདི་གཞི་བཻཌཱུརྱ་སྔོན་པོའི་རྒྱུ་ལས་གྲུབ་པ། གསེར་གྱི་བྱེ་མ་བདལ་བར་འགྱུར་བ། དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see that this great earth is made of clay, and lacking in gold and silver, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until this great earth is fashioned of blue beryl, and strewn with sands of gold.

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་བདག་ཏུ་བྱ་བའི་ཡོངས་སུ་འཛིན་པ་ལ་གནས་པ་དག་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། སེམས་ཅན་རྣམས་བདག་གིར་བྱ་བ་ལ་ཡོངས་སུ་འཛིན་པ་མི་འབྱུང་ཞིང་མི་སྲིད་པ་དང་།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see beings indulging in acquisitiveness, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, beings will not indulge in acquisitiveness.

source: སེམས་ཅན་ཐམས་ཅད་བདག་གི་མེད་པ་དང་། ཡོངས་སུ་འཛིན་པར་མི་འགྱུར་བ་དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: That will be impossible. I will practice the six perfections until all beings are without possessiveness and without acquisitiveness.

source: །སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱའོ་ཞེས་དེ་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ།
en: I will bring beings to maturity!’

source: རབ་འབྱོར་དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ཀྱང་ཡོངས་སུ་རྫོགས་པར་བྱེད། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། རྒྱལ་རིགས་དང་། བྲམ་ཟེའི་རིགས་དང་། རྗེའུ་རིགས་དང་།
en: Subhūti, bodhisattva great beings who practice accordingly will indeed complete the six perfections.

source: དམངས་རིགས་དང་།
en: They will also approach all-aspect omniscience. “

source: རིགས་བཞི་པོ་མཐོང་ན། འདི་ལྟར་ཡོངས་སུ་བརྟག་པར་བྱ་སྟེ། ཅི་ནས་ཀྱང་བདག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན། ཆུང་ངུ་ན་རིགས་བཞིའི་སྒྲ་ཡང་མི་གྲག་ཅིང་མི་སྲིད་པ། དེ་ལྟ་དེ་ལྟར་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ།
en: Moreover, Subhūti, when bodhisattva great beings practice the six perfections, if they see the four social classes, namely, the royal class, the priestly class, the merchant class, and the laboring class, they should reflect, ‘In this buddhafield where I will have by all means attained consummate buddhahood in unsurpassed, complete enlightenment, I will practice the six perfections until, at the very least, even the names of the four social classes are no longer heard. That will be impossible.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ཡང་ཉེ་བར་གྱུར་པ་ཡིན་ནོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རབ་དང་།
en: They will also approach all-aspect omniscience. {

source: འབྲིང་དང་།
en: Ki.
